backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 9]
      dtype: float32
      name: input_1
      ragged: false
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Model
    config:
      input_layers:
      - [input_0, 0, 0]
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple [null, 9]
          dtype: float32
          name: input_0
          ragged: false
          sparse: false
        inbound_nodes: []
        name: input_0
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: Zeros
            config: {}
          kernel_regularizer: null
          name: '80'
          trainable: true
          units: 256
          use_bias: true
        inbound_nodes:
        - - - input_0
            - 0
            - 0
            - {}
        name: '80'
      - class_name: Activation
        config: {activation: relu, dtype: float32, name: '81', trainable: true}
        inbound_nodes:
        - - - '80'
            - 0
            - 0
            - {}
        name: '81'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoLZXhwYW5kX2RpbXMpA9oB

            eNoEYXhpc3ICAAAAqQByCAAAAPpUL1VzZXJzL2V4cHduZW50aWFsL3l0LWNvbmRhL2xpYi9weXRo

            b24zLjYvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFzL3Jlc2hhcGVfbGF5ZXJzLnB52gx0YXJnZXRf

            bGF5ZXLbAAAAcwQAAAAAAQwB

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '82'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '81'
            - 0
            - 0
            - {}
        name: '82'
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - [1]
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 9.999999747378752e-06
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.8999999761581421
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: '83'
          scale: true
          trainable: true
        inbound_nodes:
        - - - '82'
            - 0
            - 0
            - {}
        name: '83'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoHc3F1ZWV6ZSkD2gF42gRh

            eGlzcgIAAACpAHIIAAAA+lQvVXNlcnMvZXhwd25lbnRpYWwveXQtY29uZGEvbGliL3B5dGhvbjMu

            Ni9zaXRlLXBhY2thZ2VzL29ubngya2VyYXMvcmVzaGFwZV9sYXllcnMucHnaDHRhcmdldF9sYXll

            cm0BAABzBAAAAAABDAE=

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '84'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '83'
            - 0
            - 0
            - {}
        name: '84'
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: Zeros
            config: {}
          kernel_regularizer: null
          name: '85'
          trainable: true
          units: 256
          use_bias: true
        inbound_nodes:
        - - - '84'
            - 0
            - 0
            - {}
        name: '85'
      - class_name: Activation
        config: {activation: relu, dtype: float32, name: '86', trainable: true}
        inbound_nodes:
        - - - '85'
            - 0
            - 0
            - {}
        name: '86'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoLZXhwYW5kX2RpbXMpA9oB

            eNoEYXhpc3ICAAAAqQByCAAAAPpUL1VzZXJzL2V4cHduZW50aWFsL3l0LWNvbmRhL2xpYi9weXRo

            b24zLjYvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFzL3Jlc2hhcGVfbGF5ZXJzLnB52gx0YXJnZXRf

            bGF5ZXLbAAAAcwQAAAAAAQwB

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '87'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '86'
            - 0
            - 0
            - {}
        name: '87'
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - [1]
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 9.999999747378752e-06
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.8999999761581421
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: '88'
          scale: true
          trainable: true
        inbound_nodes:
        - - - '87'
            - 0
            - 0
            - {}
        name: '88'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoHc3F1ZWV6ZSkD2gF42gRh

            eGlzcgIAAACpAHIIAAAA+lQvVXNlcnMvZXhwd25lbnRpYWwveXQtY29uZGEvbGliL3B5dGhvbjMu

            Ni9zaXRlLXBhY2thZ2VzL29ubngya2VyYXMvcmVzaGFwZV9sYXllcnMucHnaDHRhcmdldF9sYXll

            cm0BAABzBAAAAAABDAE=

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '89'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '88'
            - 0
            - 0
            - {}
        name: '89'
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: Zeros
            config: {}
          kernel_regularizer: null
          name: '90'
          trainable: true
          units: 256
          use_bias: true
        inbound_nodes:
        - - - '89'
            - 0
            - 0
            - {}
        name: '90'
      - class_name: Activation
        config: {activation: relu, dtype: float32, name: '91', trainable: true}
        inbound_nodes:
        - - - '90'
            - 0
            - 0
            - {}
        name: '91'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoLZXhwYW5kX2RpbXMpA9oB

            eNoEYXhpc3ICAAAAqQByCAAAAPpUL1VzZXJzL2V4cHduZW50aWFsL3l0LWNvbmRhL2xpYi9weXRo

            b24zLjYvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFzL3Jlc2hhcGVfbGF5ZXJzLnB52gx0YXJnZXRf

            bGF5ZXLbAAAAcwQAAAAAAQwB

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '92'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '91'
            - 0
            - 0
            - {}
        name: '92'
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - [1]
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 9.999999747378752e-06
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.8999999761581421
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: '93'
          scale: true
          trainable: true
        inbound_nodes:
        - - - '92'
            - 0
            - 0
            - {}
        name: '93'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoHc3F1ZWV6ZSkD2gF42gRh

            eGlzcgIAAACpAHIIAAAA+lQvVXNlcnMvZXhwd25lbnRpYWwveXQtY29uZGEvbGliL3B5dGhvbjMu

            Ni9zaXRlLXBhY2thZ2VzL29ubngya2VyYXMvcmVzaGFwZV9sYXllcnMucHnaDHRhcmdldF9sYXll

            cm0BAABzBAAAAAABDAE=

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '94'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '93'
            - 0
            - 0
            - {}
        name: '94'
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: Zeros
            config: {}
          kernel_regularizer: null
          name: '95'
          trainable: true
          units: 256
          use_bias: true
        inbound_nodes:
        - - - '94'
            - 0
            - 0
            - {}
        name: '95'
      - class_name: Activation
        config: {activation: relu, dtype: float32, name: '96', trainable: true}
        inbound_nodes:
        - - - '95'
            - 0
            - 0
            - {}
        name: '96'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoLZXhwYW5kX2RpbXMpA9oB

            eNoEYXhpc3ICAAAAqQByCAAAAPpUL1VzZXJzL2V4cHduZW50aWFsL3l0LWNvbmRhL2xpYi9weXRo

            b24zLjYvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFzL3Jlc2hhcGVfbGF5ZXJzLnB52gx0YXJnZXRf

            bGF5ZXLbAAAAcwQAAAAAAQwB

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '97'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '96'
            - 0
            - 0
            - {}
        name: '97'
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - [1]
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 9.999999747378752e-06
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.8999999761581421
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: '98'
          scale: true
          trainable: true
        inbound_nodes:
        - - - '97'
            - 0
            - 0
            - {}
        name: '98'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoHc3F1ZWV6ZSkD2gF42gRh

            eGlzcgIAAACpAHIIAAAA+lQvVXNlcnMvZXhwd25lbnRpYWwveXQtY29uZGEvbGliL3B5dGhvbjMu

            Ni9zaXRlLXBhY2thZ2VzL29ubngya2VyYXMvcmVzaGFwZV9sYXllcnMucHnaDHRhcmdldF9sYXll

            cm0BAABzBAAAAAABDAE=

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '99'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '98'
            - 0
            - 0
            - {}
        name: '99'
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: Zeros
            config: {}
          kernel_regularizer: null
          name: '100'
          trainable: true
          units: 256
          use_bias: true
        inbound_nodes:
        - - - '99'
            - 0
            - 0
            - {}
        name: '100'
      - class_name: Activation
        config: {activation: relu, dtype: float32, name: '101', trainable: true}
        inbound_nodes:
        - - - '100'
            - 0
            - 0
            - {}
        name: '101'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoLZXhwYW5kX2RpbXMpA9oB

            eNoEYXhpc3ICAAAAqQByCAAAAPpUL1VzZXJzL2V4cHduZW50aWFsL3l0LWNvbmRhL2xpYi9weXRo

            b24zLjYvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFzL3Jlc2hhcGVfbGF5ZXJzLnB52gx0YXJnZXRf

            bGF5ZXLbAAAAcwQAAAAAAQwB

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '102'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '101'
            - 0
            - 0
            - {}
        name: '102'
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - [1]
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 9.999999747378752e-06
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.8999999761581421
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: '103'
          scale: true
          trainable: true
        inbound_nodes:
        - - - '102'
            - 0
            - 0
            - {}
        name: '103'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoHc3F1ZWV6ZSkD2gF42gRh

            eGlzcgIAAACpAHIIAAAA+lQvVXNlcnMvZXhwd25lbnRpYWwveXQtY29uZGEvbGliL3B5dGhvbjMu

            Ni9zaXRlLXBhY2thZ2VzL29ubngya2VyYXMvcmVzaGFwZV9sYXllcnMucHnaDHRhcmdldF9sYXll

            cm0BAABzBAAAAAABDAE=

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '104'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '103'
            - 0
            - 0
            - {}
        name: '104'
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: Zeros
            config: {}
          kernel_regularizer: null
          name: '105'
          trainable: true
          units: 256
          use_bias: true
        inbound_nodes:
        - - - '104'
            - 0
            - 0
            - {}
        name: '105'
      - class_name: Activation
        config: {activation: relu, dtype: float32, name: '106', trainable: true}
        inbound_nodes:
        - - - '105'
            - 0
            - 0
            - {}
        name: '106'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoLZXhwYW5kX2RpbXMpA9oB

            eNoEYXhpc3ICAAAAqQByCAAAAPpUL1VzZXJzL2V4cHduZW50aWFsL3l0LWNvbmRhL2xpYi9weXRo

            b24zLjYvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFzL3Jlc2hhcGVfbGF5ZXJzLnB52gx0YXJnZXRf

            bGF5ZXLbAAAAcwQAAAAAAQwB

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '107'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '106'
            - 0
            - 0
            - {}
        name: '107'
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - [1]
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 9.999999747378752e-06
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.8999999761581421
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: '108'
          scale: true
          trainable: true
        inbound_nodes:
        - - - '107'
            - 0
            - 0
            - {}
        name: '108'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoHc3F1ZWV6ZSkD2gF42gRh

            eGlzcgIAAACpAHIIAAAA+lQvVXNlcnMvZXhwd25lbnRpYWwveXQtY29uZGEvbGliL3B5dGhvbjMu

            Ni9zaXRlLXBhY2thZ2VzL29ubngya2VyYXMvcmVzaGFwZV9sYXllcnMucHnaDHRhcmdldF9sYXll

            cm0BAABzBAAAAAABDAE=

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '109'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '108'
            - 0
            - 0
            - {}
        name: '109'
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: Zeros
            config: {}
          kernel_regularizer: null
          name: '110'
          trainable: true
          units: 256
          use_bias: true
        inbound_nodes:
        - - - '109'
            - 0
            - 0
            - {}
        name: '110'
      - class_name: Activation
        config: {activation: relu, dtype: float32, name: '111', trainable: true}
        inbound_nodes:
        - - - '110'
            - 0
            - 0
            - {}
        name: '111'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoLZXhwYW5kX2RpbXMpA9oB

            eNoEYXhpc3ICAAAAqQByCAAAAPpUL1VzZXJzL2V4cHduZW50aWFsL3l0LWNvbmRhL2xpYi9weXRo

            b24zLjYvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFzL3Jlc2hhcGVfbGF5ZXJzLnB52gx0YXJnZXRf

            bGF5ZXLbAAAAcwQAAAAAAQwB

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '112'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '111'
            - 0
            - 0
            - {}
        name: '112'
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - [1]
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 9.999999747378752e-06
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.8999999761581421
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: '113'
          scale: true
          trainable: true
        inbound_nodes:
        - - - '112'
            - 0
            - 0
            - {}
        name: '113'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoHc3F1ZWV6ZSkD2gF42gRh

            eGlzcgIAAACpAHIIAAAA+lQvVXNlcnMvZXhwd25lbnRpYWwveXQtY29uZGEvbGliL3B5dGhvbjMu

            Ni9zaXRlLXBhY2thZ2VzL29ubngya2VyYXMvcmVzaGFwZV9sYXllcnMucHnaDHRhcmdldF9sYXll

            cm0BAABzBAAAAAABDAE=

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '114'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '113'
            - 0
            - 0
            - {}
        name: '114'
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: Zeros
            config: {}
          kernel_regularizer: null
          name: '115'
          trainable: true
          units: 256
          use_bias: true
        inbound_nodes:
        - - - '114'
            - 0
            - 0
            - {}
        name: '115'
      - class_name: Activation
        config: {activation: relu, dtype: float32, name: '116', trainable: true}
        inbound_nodes:
        - - - '115'
            - 0
            - 0
            - {}
        name: '116'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoLZXhwYW5kX2RpbXMpA9oB

            eNoEYXhpc3ICAAAAqQByCAAAAPpUL1VzZXJzL2V4cHduZW50aWFsL3l0LWNvbmRhL2xpYi9weXRo

            b24zLjYvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFzL3Jlc2hhcGVfbGF5ZXJzLnB52gx0YXJnZXRf

            bGF5ZXLbAAAAcwQAAAAAAQwB

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '117'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '116'
            - 0
            - 0
            - {}
        name: '117'
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - [1]
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 9.999999747378752e-06
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.8999999761581421
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: '118'
          scale: true
          trainable: true
        inbound_nodes:
        - - - '117'
            - 0
            - 0
            - {}
        name: '118'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoHc3F1ZWV6ZSkD2gF42gRh

            eGlzcgIAAACpAHIIAAAA+lQvVXNlcnMvZXhwd25lbnRpYWwveXQtY29uZGEvbGliL3B5dGhvbjMu

            Ni9zaXRlLXBhY2thZ2VzL29ubngya2VyYXMvcmVzaGFwZV9sYXllcnMucHnaDHRhcmdldF9sYXll

            cm0BAABzBAAAAAABDAE=

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '119'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '118'
            - 0
            - 0
            - {}
        name: '119'
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: Zeros
            config: {}
          kernel_regularizer: null
          name: '120'
          trainable: true
          units: 256
          use_bias: true
        inbound_nodes:
        - - - '119'
            - 0
            - 0
            - {}
        name: '120'
      - class_name: Activation
        config: {activation: relu, dtype: float32, name: '121', trainable: true}
        inbound_nodes:
        - - - '120'
            - 0
            - 0
            - {}
        name: '121'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoLZXhwYW5kX2RpbXMpA9oB

            eNoEYXhpc3ICAAAAqQByCAAAAPpUL1VzZXJzL2V4cHduZW50aWFsL3l0LWNvbmRhL2xpYi9weXRo

            b24zLjYvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFzL3Jlc2hhcGVfbGF5ZXJzLnB52gx0YXJnZXRf

            bGF5ZXLbAAAAcwQAAAAAAQwB

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '122'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '121'
            - 0
            - 0
            - {}
        name: '122'
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - [1]
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 9.999999747378752e-06
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.8999999761581421
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: '123'
          scale: true
          trainable: true
        inbound_nodes:
        - - - '122'
            - 0
            - 0
            - {}
        name: '123'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoHc3F1ZWV6ZSkD2gF42gRh

            eGlzcgIAAACpAHIIAAAA+lQvVXNlcnMvZXhwd25lbnRpYWwveXQtY29uZGEvbGliL3B5dGhvbjMu

            Ni9zaXRlLXBhY2thZ2VzL29ubngya2VyYXMvcmVzaGFwZV9sYXllcnMucHnaDHRhcmdldF9sYXll

            cm0BAABzBAAAAAABDAE=

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '124'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '123'
            - 0
            - 0
            - {}
        name: '124'
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: Zeros
            config: {}
          kernel_regularizer: null
          name: '125'
          trainable: true
          units: 128
          use_bias: true
        inbound_nodes:
        - - - '124'
            - 0
            - 0
            - {}
        name: '125'
      - class_name: Activation
        config: {activation: relu, dtype: float32, name: '126', trainable: true}
        inbound_nodes:
        - - - '125'
            - 0
            - 0
            - {}
        name: '126'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoLZXhwYW5kX2RpbXMpA9oB

            eNoEYXhpc3ICAAAAqQByCAAAAPpUL1VzZXJzL2V4cHduZW50aWFsL3l0LWNvbmRhL2xpYi9weXRo

            b24zLjYvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFzL3Jlc2hhcGVfbGF5ZXJzLnB52gx0YXJnZXRf

            bGF5ZXLbAAAAcwQAAAAAAQwB

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '127'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '126'
            - 0
            - 0
            - {}
        name: '127'
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - [1]
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 9.999999747378752e-06
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.8999999761581421
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: '128'
          scale: true
          trainable: true
        inbound_nodes:
        - - - '127'
            - 0
            - 0
            - {}
        name: '128'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoHc3F1ZWV6ZSkD2gF42gRh

            eGlzcgIAAACpAHIIAAAA+lQvVXNlcnMvZXhwd25lbnRpYWwveXQtY29uZGEvbGliL3B5dGhvbjMu

            Ni9zaXRlLXBhY2thZ2VzL29ubngya2VyYXMvcmVzaGFwZV9sYXllcnMucHnaDHRhcmdldF9sYXll

            cm0BAABzBAAAAAABDAE=

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '129'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '128'
            - 0
            - 0
            - {}
        name: '129'
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: Zeros
            config: {}
          kernel_regularizer: null
          name: '130'
          trainable: true
          units: 64
          use_bias: true
        inbound_nodes:
        - - - '129'
            - 0
            - 0
            - {}
        name: '130'
      - class_name: Activation
        config: {activation: relu, dtype: float32, name: '131', trainable: true}
        inbound_nodes:
        - - - '130'
            - 0
            - 0
            - {}
        name: '131'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoLZXhwYW5kX2RpbXMpA9oB

            eNoEYXhpc3ICAAAAqQByCAAAAPpUL1VzZXJzL2V4cHduZW50aWFsL3l0LWNvbmRhL2xpYi9weXRo

            b24zLjYvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFzL3Jlc2hhcGVfbGF5ZXJzLnB52gx0YXJnZXRf

            bGF5ZXLbAAAAcwQAAAAAAQwB

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '132'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '131'
            - 0
            - 0
            - {}
        name: '132'
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - [1]
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 9.999999747378752e-06
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.8999999761581421
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: '133'
          scale: true
          trainable: true
        inbound_nodes:
        - - - '132'
            - 0
            - 0
            - {}
        name: '133'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoHc3F1ZWV6ZSkD2gF42gRh

            eGlzcgIAAACpAHIIAAAA+lQvVXNlcnMvZXhwd25lbnRpYWwveXQtY29uZGEvbGliL3B5dGhvbjMu

            Ni9zaXRlLXBhY2thZ2VzL29ubngya2VyYXMvcmVzaGFwZV9sYXllcnMucHnaDHRhcmdldF9sYXll

            cm0BAABzBAAAAAABDAE=

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '134'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '133'
            - 0
            - 0
            - {}
        name: '134'
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: Zeros
            config: {}
          kernel_regularizer: null
          name: '135'
          trainable: true
          units: 1
          use_bias: true
        inbound_nodes:
        - - - '134'
            - 0
            - 0
            - {}
        name: '135'
      - class_name: Activation
        config: {activation: sigmoid, dtype: float32, name: output_0, trainable: true}
        inbound_nodes:
        - - - '135'
            - 0
            - 0
            - {}
        name: output_0
      name: model
      output_layers:
      - [output_0, 0, 0]
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: model
  - class_name: Model
    config:
      input_layers:
      - [input_0, 0, 0]
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple [null, 9]
          dtype: float32
          name: input_0
          ragged: false
          sparse: false
        inbound_nodes: []
        name: input_0
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: Zeros
            config: {}
          kernel_regularizer: null
          name: '80'
          trainable: true
          units: 256
          use_bias: true
        inbound_nodes:
        - - - input_0
            - 0
            - 0
            - {}
        name: '80'
      - class_name: Activation
        config: {activation: relu, dtype: float32, name: '81', trainable: true}
        inbound_nodes:
        - - - '80'
            - 0
            - 0
            - {}
        name: '81'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoLZXhwYW5kX2RpbXMpA9oB

            eNoEYXhpc3ICAAAAqQByCAAAAPpUL1VzZXJzL2V4cHduZW50aWFsL3l0LWNvbmRhL2xpYi9weXRo

            b24zLjYvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFzL3Jlc2hhcGVfbGF5ZXJzLnB52gx0YXJnZXRf

            bGF5ZXLbAAAAcwQAAAAAAQwB

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '82'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '81'
            - 0
            - 0
            - {}
        name: '82'
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - [1]
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 9.999999747378752e-06
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.8999999761581421
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: '83'
          scale: true
          trainable: true
        inbound_nodes:
        - - - '82'
            - 0
            - 0
            - {}
        name: '83'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoHc3F1ZWV6ZSkD2gF42gRh

            eGlzcgIAAACpAHIIAAAA+lQvVXNlcnMvZXhwd25lbnRpYWwveXQtY29uZGEvbGliL3B5dGhvbjMu

            Ni9zaXRlLXBhY2thZ2VzL29ubngya2VyYXMvcmVzaGFwZV9sYXllcnMucHnaDHRhcmdldF9sYXll

            cm0BAABzBAAAAAABDAE=

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '84'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '83'
            - 0
            - 0
            - {}
        name: '84'
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: Zeros
            config: {}
          kernel_regularizer: null
          name: '85'
          trainable: true
          units: 256
          use_bias: true
        inbound_nodes:
        - - - '84'
            - 0
            - 0
            - {}
        name: '85'
      - class_name: Activation
        config: {activation: relu, dtype: float32, name: '86', trainable: true}
        inbound_nodes:
        - - - '85'
            - 0
            - 0
            - {}
        name: '86'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoLZXhwYW5kX2RpbXMpA9oB

            eNoEYXhpc3ICAAAAqQByCAAAAPpUL1VzZXJzL2V4cHduZW50aWFsL3l0LWNvbmRhL2xpYi9weXRo

            b24zLjYvc2l0ZS1wYWNrYWdlcy9vbm54MmtlcmFzL3Jlc2hhcGVfbGF5ZXJzLnB52gx0YXJnZXRf

            bGF5ZXLbAAAAcwQAAAAAAQwB

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '87'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '86'
            - 0
            - 0
            - {}
        name: '87'
      - class_name: BatchNormalization
        config:
          axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
          - [1]
          beta_constraint: null
          beta_initializer:
            class_name: Zeros
            config: {}
          beta_regularizer: null
          center: true
          dtype: float32
          epsilon: 9.999999747378752e-06
          gamma_constraint: null
          gamma_initializer:
            class_name: Ones
            config: {}
          gamma_regularizer: null
          momentum: 0.8999999761581421
          moving_mean_initializer:
            class_name: Zeros
            config: {}
          moving_variance_initializer:
            class_name: Ones
            config: {}
          name: '88'
          scale: true
          trainable: true
        inbound_nodes:
        - - - '87'
            - 0
            - 0
            - {}
        name: '88'
      - class_name: Lambda
        config:
          arguments: {}
          dtype: float32
          function: !!python/tuple
          - '4wIAAAAAAAAAAwAAAAMAAABTAAAAcxoAAABkAWQCbABtAX0CAQB8AmoCagN8AHwBgwJTACkDTukA

            AAAAKQHaBWtlcmFzKQTaCnRlbnNvcmZsb3dyAgAAANoHYmFja2VuZNoHc3F1ZWV6ZSkD2gF42gRh

            eGlzcgIAAACpAHIIAAAA+lQvVXNlcnMvZXhwd25lbnRpYWwveXQtY29uZGEvbGliL3B5dGhvbjMu

            Ni9zaXRlLXBhY2thZ2VzL29ubngya2VyYXMvcmVzaGFwZV9sYXllcnMucHnaDHRhcmdldF9sYXll

            cm0BAABzBAAAAAABDAE=

            '
          - !!python/tuple [2]
          - null
          function_type: lambda
          module: tensorflow.python.keras.layers.core
          name: '89'
          output_shape: null
          output_shape_module: null
          output_shape_type: raw
          trainable: true
        inbound_nodes:
        - - - '88'
            - 0
            - 0
            - {}
        name: '89'
      - class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
